       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 Numero PIC S99V99 VALUE -80.75.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY Numero.
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
