
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 sitiowed PIC X(27) value "www.programa.com".

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY sitiowed.
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
